name: "onnx-mnist"
platform: "onnxruntime_onnx"
max_batch_size: 0

input [
    {
        name: "input",
        data_type: TYPE_FP32,
        dims: [-1,1,28,28]
    }
]

output [
    {
        name: "output",
        data_type: TYPE_FP32,
        dims: [-1,10]
    }
]

instance_group [
    {
        count: 1,
        kind: KIND_CPU
    }
]

dynamic_batching: { max_queue_delay_microseconds: 2000 }
